Revit 2027 API
StructuralSectionGeneralR Constructor
 Creates a new instance of Structural Section Pipe.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralSectionGeneralR(
	double diameter,
	double wallNominalThickness,
	double wallDesignThickness,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams analysisParams
)
Public Sub New (
	diameter As Double,
	wallNominalThickness As Double,
	wallDesignThickness As Double,
	centroidHorizontal As Double,
	centroidVertical As Double,
	analysisParams As StructuralSectionAnalysisParams
)
public:
StructuralSectionGeneralR(
	double diameter,
	double wallNominalThickness,
	double wallDesignThickness,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams^ analysisParams
)
new :
        diameter : float *
        wallNominalThickness : float *
        wallDesignThickness : float *
        centroidHorizontal : float *
        centroidVertical : float *
        analysisParams : StructuralSectionAnalysisParams -> StructuralSectionGeneralR
Parameters
diameter Double
 Pipe Diameter.
wallNominalThickness Double
 Represents wall nominal thickness of rectangle.
wallDesignThickness Double
 Represents wall design thickness of rectangle.
centroidHorizontal Double
 Distance from centroid to the left extremites along horizontal axis.
centroidVertical Double
 Distance from centroid to the upper extremites along vertical axis.
analysisParams StructuralSectionAnalysisParams
 Common set of parameters for structural analysis.
See Also
Reference
StructuralSectionGeneralR Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace